Revit 2024 API
BuiltInFailures.CutFailures.DormerCutProblem Property
 Dormer Opening Cut is not fully defined. Cut was not performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DormerCutProblem { get; }
Visual Basic
Public Shared ReadOnly Property DormerCutProblem As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DormerCutProblem {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace